testCases/redistributeTestCase/system/VOFSetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      VOFSetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultSpecies
(
);

liquidPhaseName alpha1;
vaporPhaseName none;

droplets
(
    Drop1
    {
        center   (0 0.001 0.005);
        radius   (0 0.0005 0.0005);
        delVapor 1e-4;
        U        (0 0 0);
        liquidSpecies
        (
        );
        vaporSpecies
        (
        );
    }
    /*
    Drop2
    {
        center   (0 0.005 0.005);
        radius   (0 0.0005 0.0005);
        delVapor 1e-4;
        U        (0 0 0);
        liquidSpecies
        (
        );
        vaporSpecies
        (
        );
    }
    
    Drop3
    {
        center   (0 0.003 0.005);
        radius   (0 0.0005 0.0005);
        delVapor 1e-4;
        U        (0 0 0);
        liquidSpecies
        (
        );
        vaporSpecies
        (
        );
    }*/
);


// ************************************************************************* //
